---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Entity.IsValidObject
source: html/2c3f7cb9-4a13-bc09-b63f-bdda2b70d84a.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Entity.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.